Revit 2027 API
BuiltInFailures.DisplacementElementFailures.DetectedCycleInDisplacedElementParents Property
 Invalid parent relationship for a Displacement element. No cycles are allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DetectedCycleInDisplacedElementParents { get; }
Public Shared ReadOnly Property DetectedCycleInDisplacedElementParents As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DetectedCycleInDisplacedElementParents {
	FailureDefinitionId^ get ();
}
static member DetectedCycleInDisplacedElementParents : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DisplacementElementFailures Class
Autodesk.Revit.DB Namespace